app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "s fn edit"], ["updated_at", "2022-02-14 17:43:39.649258"], ["id", 4]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(student_params)